In [ ]:
import pandas as pd

from sklearn.preprocessing import LabelEncoder

In [ ]:
from google.colab import drive

drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

# Utilize o dataset (Titanic) visto em aula para realizar estes exercícios.

In [ ]:
titanic = pd.read_csv('/content/drive/My Drive/MATB06/train.csv')

In [ ]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [ ]:
titanic.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

## Alguns nomes utilizados no dataset do titanic, são de passageiros reais, poderemos verificar pelo Reverend Charles Leonard Kirkland, que nasceu em Miramichi, New Brunswick, Canada em março 1841. Durante a década de 1870, após uma carreira como carpinteiro, Kirkland tornou-se um ministro batista evangélico. - [link](https://www.encyclopedia-titanica.org/titanic-victim/charles-kirkland.html)

### Separe os títulos junto aos nomes dos passageiros

* Exemplo o padrão de nomes seguem
    * Braund, Mr. Owen Harris	- Mr.
    * Heikkinen, Miss. Laina    - Miss.
    * Kirkland, Rev. Charles Leonard
    * Último Nome, TÍTULO. NOME
    
### Adicione uma coluna com essa nova informação dos títulos dos passageiros.

### Acompanhado com o reverendo Charles Leonard Kirkland, quantos reverendos - título = Rev - temos nesse dataset?

In [ ]:
def getTitulo(s):
  return s.split(',')[1].split('.')[0]

titanic['titulo'] = titanic['Name'].apply(getTitulo)

In [ ]:
titanic.head()

   PassengerId  Survived  Pclass  ... Cabin Embarked  titulo
0            1         0       3  ...   NaN        S      Mr
1            2         1       1  ...   C85        C     Mrs
2            3         1       3  ...   NaN        S    Miss
3            4         1       1  ...  C123        S     Mrs
4            5         0       3  ...   NaN        S      Mr

[5 rows x 13 columns]

## Utilize as técnicas de imputação de dados faltantes para preencher as colunas:
* AGE
* Embarked

In [ ]:
titanic[['Age','Embarked']].info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Age       714 non-null    float64
 1   Embarked  889 non-null    object
dtypes: float64(1), object(1)
memory usage: 14.0+ KB

In [ ]:
titanic['Age'] = titanic['Age'].fillna(titanic['Age'].mode()[0])
titanic['Embarked'] = titanic['Embarked'].fillna(titanic['Embarked'].mode()[0])

In [ ]:
titanic[['Age','Embarked']].info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Age       891 non-null    float64
 1   Embarked  891 non-null    object
dtypes: float64(1), object(1)
memory usage: 14.0+ KB

### Age - Utilize a mediana das idades dos passageiros.

In [ ]:
titanic['Age'].median()

24.0

### Embarked - Utilize o método backfill (bfill), utilizado pela função do pandas fillna.

In [ ]:
titanic['Embarked'] = titanic['Embarked'].bfill()

0      S
1      C
2      S
3      S
4      S
      ..
886    S
887    S
888    S
889    C
890    Q
Name: Embarked, Length: 891, dtype: object

## Utilize o LabelEncoder para representar os Tickets de forma numérica.

* Ex.:
![image.png](attachment:image.png)

* OBS.: Não precisam está iguais ao da imagem, o importante é está em um formato inteiro(INT).

*
* Curiosidade: Aparentemente todos que estão com o mesmo ticket pertecem a mesma família, será? Vamos agrupar pelos passageiros com o mesmo ticket e identificar esses passageiros?


![image-2.png](attachment:image-2.png)